Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPL_DFP/1.3.57/atdf/PIC32MM0016GPL020.atdf
         <register caption="" name="ADC1BUF1" offset="0x10" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADC1BUF1" />
         </register>
         <register caption="" name="ADC1BUF2" offset="0x20" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADC1BUF2" />
         </register>
         <register caption="" name="ADC1BUF3" offset="0x30" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADC1BUF3" />
         </register>
         <register caption="" name="ADC1BUF4" offset="0x40" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADC1BUF4" />
         </register>
         <register caption="" name="ADC1BUF5" offset="0x50" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADC1BUF5" />
         </register>
         <register caption="" name="ADC1BUF6" offset="0x60" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADC1BUF6" />
         </register>
         <register caption="" name="ADC1BUF7" offset="0x70" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADC1BUF7" />
         </register>
         <register caption="" name="ADC1BUF8" offset="0x80" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADC1BUF8" />
         </register>
         <register caption="" name="ADC1BUF9" offset="0x90" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADC1BUF9" />
         </register>
         <register caption="" name="ADC1BUF10" offset="0xa0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADC1BUF10" />
         </register>
         <register caption="" name="ADC1BUF11" offset="0xb0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADC1BUF11" />
         </register>
         <register caption="" name="ADC1BUF12" offset="0xc0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADC1BUF12" />
         </register>
         <register caption="" name="ADC1BUF13" offset="0xd0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADC1BUF13" />
         </register>
         <register caption="" name="ADC1BUF14" offset="0xe0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADC1BUF14" />
         </register>
         <register caption="" name="ADC1BUF15" offset="0xf0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="ADC1BUF15" />
         </register>
         <register caption="ADC Control Register 1" name="AD1CON1" initval="0x0" offset="0x100" rw="RW" size="4">
            <bitfield caption="Analog-to-Digital Conversion Status bit" mask="0x00000001" name="DONE" values="AD1CON1__DONE" />
            <bitfield caption="ADC Sample Enable bit" mask="0x00000002" name="SAMP" values="AD1CON1__SAMP" />
            <bitfield caption="ADC Sample Auto-Start bit" mask="0x00000004" name="ASAM" values="AD1CON1__ASAM" />
            <bitfield caption="ADC Operation Mode" mask="0x00000008" name="MODE12" values="AD1CON1__MODE12" />
            <bitfield caption="Conversion Trigger Source Select bits" mask="0x000000F0" name="SSRC" values="AD1CON1__SSRC" />
            <bitfield caption="Data Output Format bits" mask="0x00000700" name="FORM" values="AD1CON1__FORM" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="AD1CON1__SIDL" />
            <bitfield caption="ADC Operating Mode bit" mask="0x00008000" name="ON" values="AD1CON1__ON" />
         </register>
         <register caption="" name="AD1CON2" initval="0x0" offset="0x110" rw="RW" size="4">
            <bitfield caption="ADC Result Buffer Mode Select bit" mask="0x00000002" name="BUFM" values="AD1CON2__BUFM" />
            <bitfield caption="Sample/Convert Sequences Per Interrupt Selection bits" mask="0x0000007C" name="SMPI" values="AD1CON2__SMPI" />
            <bitfield caption="Buffer Fill Status bit" mask="0x00000080" name="BUFS" values="AD1CON2__BUFS" />
            <bitfield caption="Input Scan Select bit" mask="0x00000400" name="CSCNA" values="AD1CON2__CSCNA" />
            <bitfield caption="" mask="0x00000800" name="BUFREGEN" />
            <bitfield caption="Input Offset Calibration Mode Select bit" mask="0x00001000" name="OFFCAL" values="AD1CON2__OFFCAL" />
            <bitfield caption="Voltage Reference Configuration bits" mask="0x0000E000" name="VCFG" values="AD1CON2__VCFG" />
         </register>
         <register caption="" name="AD1CON3" offset="0x120" rw="RW" size="4">
            <bitfield caption="ADC Conversion Clock Select bits" mask="0x000000FF" name="ADCS" values="AD1CON3__ADCS" />
            <bitfield caption="Auto-Sample Time bits" mask="0x00001F00" name="SAMC" values="AD1CON3__SAMC" />
            <bitfield caption="" mask="0x00002000" name="PUMPEN" />
            <bitfield caption="Extended Sampling Time bit" mask="0x00004000" name="EXTSAM" values="AD1CON3__EXTSAM" />
            <bitfield caption="ADC Conversion Clock Source bit" mask="0x00008000" name="ADRC" values="AD1CON3__ADRC" />
         </register>
         <register caption="" name="AD1CHS" offset="0x130" rw="RW" size="4">
            <bitfield caption="Positive Input Select bits" mask="0x0000001F" name="CH0SA" values="AD1CHS__CH0SA" />
            <bitfield caption="Negative Input Select bit" mask="0x000000E0" name="CH0NA" values="AD1CHS__CH0NA" />
         </register>
         <register caption="" name="AD1CSS" offset="0x140" rw="RW" size="4">
            <bitfield caption="AN0 Pin Scan Selection bits" mask="0x00000001" name="CSS0" values="AD1CSS__CSS0" />
            <bitfield caption="AN1 Pin Scan Selection bits" mask="0x00000002" name="CSS1" values="AD1CSS__CSS1" />
            <bitfield caption="AN2 Pin Scan Selection bits" mask="0x00000004" name="CSS2" values="AD1CSS__CSS2" />
            <bitfield caption="AN3 Pin Scan Selection bits" mask="0x00000008" name="CSS3" values="AD1CSS__CSS3" />
            <bitfield caption="AN4 Pin Scan Selection bits" mask="0x00000010" name="CSS4" values="AD1CSS__CSS4" />
            <bitfield caption="AN5 Pin Scan Selection bits" mask="0x00000020" name="CSS5" values="AD1CSS__CSS5" />
            <bitfield caption="AN6 Pin Scan Selection bits" mask="0x00000040" name="CSS6" values="AD1CSS__CSS6" />
            <bitfield caption="AN7 Pin Scan Selection bits" mask="0x00000080" name="CSS7" values="AD1CSS__CSS7" />
            <bitfield caption="AN8 Pin Scan Selection bits" mask="0x00000100" name="CSS8" values="AD1CSS__CSS8" />
            <bitfield caption="AN9 Pin Scan Selection bits" mask="0x00000200" name="CSS9" values="AD1CSS__CSS9" />
            <bitfield caption="AN10 Pin Scan Selection bits" mask="0x00000400" name="CSS10" values="AD1CSS__CSS10" />
            <bitfield caption="VBG Scan Selection bits" mask="0x10000000" name="CSS28" values="AD1CSS__CSS28" />
            <bitfield caption="AVSS Scan Selection bits" mask="0x20000000" name="CSS29" values="AD1CSS__CSS29" />
            <bitfield caption="AVDD Scan Selection bits" mask="0x40000000" name="CSS30" values="AD1CSS__CSS30" />
         </register>
