Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPL_DFP/1.3.57/atdf/PIC32MM0016GPL020.atdf
      <value-group caption="Reference Source Select" name="DAC1CON__REFSEL">
         <value caption="No reference is selected (output is AVSS)" name="" value="0x0" />
         <value caption="Reference voltage is the CVREF+ input pin voltage" name="" value="0x1" />
         <value caption="No reference is selected (output is AVSS)" name="" value="0x2" />
         <value caption="Reference voltage is AVDD" name="" value="0x3" />
      </value-group>
      <value-group caption="CDAC Output Enable" name="DAC1CON__DACOE">
         <value caption="Output is Disabled; drive to pin is floating" name="" value="0x0" />
         <value caption="Output is Enabled; CDAC voltage is connected to the pin." name="" value="0x1" />
      </value-group>
      <value-group caption="CDAC Enable" name="DAC1CON__ON">
         <value caption="The CDAC is Disabled" name="" value="0x0" />
         <value caption="The CDAC is Enabled" name="" value="0x1" />
      </value-group>
   </module>
   <module caption="" id="02610" name="CFG" version="">
      <register-group name="CFG">
         <register caption="" name="PMDCON" offset="0x900" rw="RW" size="4">
            <bitfield caption="" mask="0x00000800" name="PMDLOCK" />
         </register>
         <register caption="" name="PMD1" offset="0x910" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ADCMD" />
            <bitfield caption="" mask="0x00001000" name="VREFMD" />
            <bitfield caption="" mask="0x00100000" name="HLVDMD" />
         </register>
         <register caption="" name="PMD2" offset="0x920" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CMP1MD" />
            <bitfield caption="" mask="0x00000002" name="CMP2MD" />
            <bitfield caption="" mask="0x01000000" name="CLC1MD" />
            <bitfield caption="" mask="0x02000000" name="CLC2MD" />
         </register>
         <register caption="" name="PMD3" offset="0x930" rw="RW" size="4">
            <bitfield caption="" mask="0x00000100" name="CCP1MD" />
            <bitfield caption="" mask="0x00000200" name="CCP2MD" />
            <bitfield caption="" mask="0x00000400" name="CCP3MD" />
         </register>
         <register caption="" name="PMD4" offset="0x940" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="T1MD" />
         </register>
         <register caption="" name="PMD5" offset="0x950" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="U1MD" />
            <bitfield caption="" mask="0x00000002" name="U2MD" />
            <bitfield caption="" mask="0x00000100" name="SPI1MD" />
            <bitfield caption="" mask="0x00000200" name="SPI2MD" />
         </register>
         <register caption="" name="PMD6" offset="0x960" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="RTCCMD" />
            <bitfield caption="" mask="0x00000100" name="REFOMD" />
         </register>
         <register caption="" name="PMD7" offset="0x970" rw="RW" size="4">
            <bitfield caption="" mask="0x00000008" name="CRCMD" />
         </register>
         <register caption="" name="CFGCON" offset="0x1800" rw="RW" size="4">
            <bitfield caption="" mask="0x00000008" name="JTAGEN" />
            <bitfield caption="" mask="0x00FF0000" name="EXECADDR" />
         </register>
         <register caption="" name="DEVID" offset="0x1820" rw="R" size="4">
            <bitfield caption="" mask="0x00000FFF" name="MAINID" />
            <bitfield caption="" mask="0x0FFFF000" name="PN" />
            <bitfield caption="" mask="0xF0000000" name="VER" />
         </register>
         <register caption="" name="SYSKEY" offset="0x1830" rw="W" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="SYSKEY" />
         </register>
         <register caption="" name="ANCFG" offset="0x0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000002" name="VBGCMP" />
            <bitfield caption="" mask="0x00000004" name="VBGADC" />
         </register>
      </register-group>
   </module>
   <module caption="" id="01577" name="CLC" version="">
      <register-group name="CLC">
         <register caption="" name="CLC1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="CLCx Mode bits" mask="0x00000007" name="MODE" values="CLC1CON__MODE" />
            <bitfield caption="CLCx Output Polarity Control bit" mask="0x00000020" name="LCPOL" values="CLC1CON__LCPOL" />
            <bitfield caption="CLCx Data Output Status bit" mask="0x00000040" name="LCOUT" values="CLC1CON__LCOUT" />
            <bitfield caption="CLCx Port Enable bit" mask="0x00000080" name="LCOE" values="CLC1CON__LCOE" />
            <bitfield caption="CLCx Negative Edge Interrupt Enable bit" mask="0x00000400" name="INTN" values="CLC1CON__INTN" />
            <bitfield caption="CLCx Positive Edge Interrupt Enable bit" mask="0x00000800" name="INTP" values="CLC1CON__INTP" />
            <bitfield caption="CLCx Enable bit" mask="0x00008000" name="ON" values="CLC1CON__ON" />
            <bitfield caption="Gate 1 Polarity Control bit" mask="0x00010000" name="G1POL" values="CLC1CON__G1POL" />
            <bitfield caption="Gate 2 Polarity Control bit" mask="0x00020000" name="G2POL" values="CLC1CON__G2POL" />
            <bitfield caption="Gate 3 Polarity Control bit" mask="0x00040000" name="G3POL" values="CLC1CON__G3POL" />
            <bitfield caption="Gate 4 Polarity Control bit" mask="0x00080000" name="G4POL" values="CLC1CON__G4POL" />
         </register>
         <register caption="" name="CLC2CON" offset="0x80" rw="RW" size="4">
            <bitfield caption="CLCx Mode bits" mask="0x00000007" name="MODE" values="CLC2CON__MODE" />
            <bitfield caption="CLCx Output Polarity Control bit" mask="0x00000020" name="LCPOL" values="CLC2CON__LCPOL" />
            <bitfield caption="CLCx Data Output Status bit" mask="0x00000040" name="LCOUT" values="CLC2CON__LCOUT" />
            <bitfield caption="CLCx Port Enable bit" mask="0x00000080" name="LCOE" values="CLC2CON__LCOE" />
            <bitfield caption="CLCx Negative Edge Interrupt Enable bit" mask="0x00000400" name="INTN" values="CLC2CON__INTN" />
            <bitfield caption="CLCx Positive Edge Interrupt Enable bit" mask="0x00000800" name="INTP" values="CLC2CON__INTP" />
            <bitfield caption="CLCx Enable bit" mask="0x00008000" name="ON" values="CLC2CON__ON" />
            <bitfield caption="Gate 1 Polarity Control bit" mask="0x00010000" name="G1POL" values="CLC2CON__G1POL" />
            <bitfield caption="Gate 2 Polarity Control bit" mask="0x00020000" name="G2POL" values="CLC2CON__G2POL" />
            <bitfield caption="Gate 3 Polarity Control bit" mask="0x00040000" name="G3POL" values="CLC2CON__G3POL" />
            <bitfield caption="Gate 4 Polarity Control bit" mask="0x00080000" name="G4POL" values="CLC2CON__G4POL" />
         </register>
         <register caption="" name="CLC1SEL" offset="0x10" rw="RW" size="4">
            <bitfield caption="Data Selection MUX 1 Signal Selection bits" mask="0x00000007" name="DS1" values="CLC1SEL__DS1" />
            <bitfield caption="Data Selection MUX 2 Signal Selection bits" mask="0x00000070" name="DS2" values="CLC1SEL__DS2" />
            <bitfield caption="Data Selection MUX 3 Signal Selection bits" mask="0x00000700" name="DS3" values="CLC1SEL__DS3" />
            <bitfield caption="Data Selection MUX 4 Signal Selection bits" mask="0x00007000" name="DS4" values="CLC1SEL__DS4" />
         </register>
         <register caption="" name="CLC2SEL" offset="0x90" rw="RW" size="4">
            <bitfield caption="Data Selection MUX 1 Signal Selection bits" mask="0x00000007" name="DS1" values="CLC2SEL__DS1" />
            <bitfield caption="Data Selection MUX 2 Signal Selection bits" mask="0x00000070" name="DS2" values="CLC2SEL__DS2" />
            <bitfield caption="Data Selection MUX 3 Signal Selection bits" mask="0x00000700" name="DS3" values="CLC2SEL__DS3" />
            <bitfield caption="Data Selection MUX 4 Signal Selection bits" mask="0x00007000" name="DS4" values="CLC2SEL__DS4" />
         </register>
         <register caption="" name="CLC1GLS" offset="0x20" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="G1D1N" />
            <bitfield caption="" mask="0x00000002" name="G1D1T" />
            <bitfield caption="" mask="0x00000004" name="G1D2N" />
            <bitfield caption="" mask="0x00000008" name="G1D2T" />
            <bitfield caption="" mask="0x00000010" name="G1D3N" />
            <bitfield caption="" mask="0x00000020" name="G1D3T" />
            <bitfield caption="" mask="0x00000040" name="G1D4N" />
            <bitfield caption="" mask="0x00000080" name="G1D4T" />
            <bitfield caption="" mask="0x00000100" name="G2D1N" />
            <bitfield caption="" mask="0x00000200" name="G2D1T" />
            <bitfield caption="" mask="0x00000400" name="G2D2N" />
            <bitfield caption="" mask="0x00000800" name="G2D2T" />
            <bitfield caption="" mask="0x00001000" name="G2D3N" />
            <bitfield caption="" mask="0x00002000" name="G2D3T" />
            <bitfield caption="" mask="0x00004000" name="G2D4N" />
            <bitfield caption="" mask="0x00008000" name="G2D4T" />
            <bitfield caption="" mask="0x00010000" name="G3D1N" />
            <bitfield caption="" mask="0x00020000" name="G3D1T" />
            <bitfield caption="" mask="0x00040000" name="G3D2N" />
            <bitfield caption="" mask="0x00080000" name="G3D2T" />
            <bitfield caption="" mask="0x00100000" name="G3D3N" />
            <bitfield caption="" mask="0x00200000" name="G3D3T" />
            <bitfield caption="" mask="0x00400000" name="G3D4N" />
            <bitfield caption="" mask="0x00800000" name="G3D4T" />
            <bitfield caption="" mask="0x01000000" name="G4D1N" />
            <bitfield caption="" mask="0x02000000" name="G4D1T" />
            <bitfield caption="" mask="0x04000000" name="G4D2N" />
            <bitfield caption="" mask="0x08000000" name="G4D2T" />
            <bitfield caption="" mask="0x10000000" name="G4D3N" />
            <bitfield caption="" mask="0x20000000" name="G4D3T" />
            <bitfield caption="" mask="0x40000000" name="G4D4N" />
            <bitfield caption="" mask="0x80000000" name="G4D4T" />
         </register>
