Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPL_DFP/1.3.57/atdf/PIC32MM0016GPL020.atdf
         <register caption="" name="ODCB" offset="0x440" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ODCB" />
            <bitfield caption="" mask="0x00000002" name="ODCB" />
            <bitfield caption="" mask="0x00000004" name="ODCB" />
            <bitfield caption="" mask="0x00000010" name="ODCB" />
            <bitfield caption="" mask="0x00000080" name="ODCB" />
            <bitfield caption="" mask="0x00000100" name="ODCB" />
            <bitfield caption="" mask="0x00000200" name="ODCB" />
            <bitfield caption="" mask="0x00001000" name="ODCB" />
            <bitfield caption="" mask="0x00002000" name="ODCB" />
            <bitfield caption="" mask="0x00004000" name="ODCB" />
            <bitfield caption="" mask="0x00008000" name="ODCB" />
         </register>
         <register caption="" name="CNPUA" offset="0x350" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPUA" />
            <bitfield caption="" mask="0x00000002" name="CNPUA" />
            <bitfield caption="" mask="0x00000004" name="CNPUA" />
            <bitfield caption="" mask="0x00000008" name="CNPUA" />
            <bitfield caption="" mask="0x00000010" name="CNPUA" />
         </register>
         <register caption="" name="CNPUB" offset="0x450" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPUB" />
            <bitfield caption="" mask="0x00000002" name="CNPUB" />
            <bitfield caption="" mask="0x00000004" name="CNPUB" />
            <bitfield caption="" mask="0x00000010" name="CNPUB" />
            <bitfield caption="" mask="0x00000080" name="CNPUB" />
            <bitfield caption="" mask="0x00000100" name="CNPUB" />
            <bitfield caption="" mask="0x00000200" name="CNPUB" />
            <bitfield caption="" mask="0x00001000" name="CNPUB" />
            <bitfield caption="" mask="0x00002000" name="CNPUB" />
            <bitfield caption="" mask="0x00004000" name="CNPUB" />
            <bitfield caption="" mask="0x00008000" name="CNPUB" />
         </register>
         <register caption="" name="CNPDA" offset="0x360" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPDA" />
            <bitfield caption="" mask="0x00000002" name="CNPDA" />
            <bitfield caption="" mask="0x00000004" name="CNPDA" />
            <bitfield caption="" mask="0x00000008" name="CNPDA" />
            <bitfield caption="" mask="0x00000010" name="CNPDA" />
         </register>
         <register caption="" name="CNPDB" offset="0x460" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPDB" />
            <bitfield caption="" mask="0x00000002" name="CNPDB" />
            <bitfield caption="" mask="0x00000004" name="CNPDB" />
            <bitfield caption="" mask="0x00000010" name="CNPDB" />
            <bitfield caption="" mask="0x00000080" name="CNPDB" />
            <bitfield caption="" mask="0x00000100" name="CNPDB" />
            <bitfield caption="" mask="0x00000200" name="CNPDB" />
            <bitfield caption="" mask="0x00001000" name="CNPDB" />
            <bitfield caption="" mask="0x00002000" name="CNPDB" />
            <bitfield caption="" mask="0x00004000" name="CNPDB" />
            <bitfield caption="" mask="0x00008000" name="CNPDB" />
         </register>
         <register caption="" name="CNCONA" offset="0x370" rw="RW" size="4">
            <bitfield caption="" mask="0x00000800" name="CNSTYLE" />
            <bitfield caption="" mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNCONB" offset="0x470" rw="RW" size="4">
            <bitfield caption="" mask="0x00000800" name="CNSTYLE" />
            <bitfield caption="" mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNEN0A" offset="0x380" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNEN0A" />
            <bitfield caption="" mask="0x00000002" name="CNEN0A" />
            <bitfield caption="" mask="0x00000004" name="CNEN0A" />
            <bitfield caption="" mask="0x00000008" name="CNEN0A" />
            <bitfield caption="" mask="0x00000010" name="CNEN0A" />
         </register>
         <register caption="" name="CNEN0B" offset="0x480" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNEN0B" />
            <bitfield caption="" mask="0x00000002" name="CNEN0B" />
            <bitfield caption="" mask="0x00000004" name="CNEN0B" />
            <bitfield caption="" mask="0x00000010" name="CNEN0B" />
            <bitfield caption="" mask="0x00000080" name="CNEN0B" />
            <bitfield caption="" mask="0x00000100" name="CNEN0B" />
            <bitfield caption="" mask="0x00000200" name="CNEN0B" />
            <bitfield caption="" mask="0x00001000" name="CNEN0B" />
            <bitfield caption="" mask="0x00002000" name="CNEN0B" />
            <bitfield caption="" mask="0x00004000" name="CNEN0B" />
            <bitfield caption="" mask="0x00008000" name="CNEN0B" />
         </register>
         <register caption="" name="CNSTATA" offset="0x390" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNSTATA" />
            <bitfield caption="" mask="0x00000002" name="CNSTATA" />
            <bitfield caption="" mask="0x00000004" name="CNSTATA" />
            <bitfield caption="" mask="0x00000008" name="CNSTATA" />
            <bitfield caption="" mask="0x00000010" name="CNSTATA" />
         </register>
         <register caption="" name="CNSTATB" offset="0x490" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNSTATB" />
            <bitfield caption="" mask="0x00000002" name="CNSTATB" />
            <bitfield caption="" mask="0x00000004" name="CNSTATB" />
            <bitfield caption="" mask="0x00000010" name="CNSTATB" />
            <bitfield caption="" mask="0x00000080" name="CNSTATB" />
            <bitfield caption="" mask="0x00000100" name="CNSTATB" />
            <bitfield caption="" mask="0x00000200" name="CNSTATB" />
            <bitfield caption="" mask="0x00001000" name="CNSTATB" />
            <bitfield caption="" mask="0x00002000" name="CNSTATB" />
            <bitfield caption="" mask="0x00004000" name="CNSTATB" />
            <bitfield caption="" mask="0x00008000" name="CNSTATB" />
         </register>
         <register caption="" name="CNEN1A" offset="0x3a0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNEN1A" />
            <bitfield caption="" mask="0x00000002" name="CNEN1A" />
            <bitfield caption="" mask="0x00000004" name="CNEN1A" />
            <bitfield caption="" mask="0x00000008" name="CNEN1A" />
            <bitfield caption="" mask="0x00000010" name="CNEN1A" />
         </register>
         <register caption="" name="CNEN1B" offset="0x4a0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNEN1B" />
            <bitfield caption="" mask="0x00000002" name="CNEN1B" />
            <bitfield caption="" mask="0x00000004" name="CNEN1B" />
            <bitfield caption="" mask="0x00000010" name="CNEN1B" />
            <bitfield caption="" mask="0x00000080" name="CNEN1B" />
            <bitfield caption="" mask="0x00000100" name="CNEN1B" />
            <bitfield caption="" mask="0x00000200" name="CNEN1B" />
            <bitfield caption="" mask="0x00001000" name="CNEN1B" />
            <bitfield caption="" mask="0x00002000" name="CNEN1B" />
            <bitfield caption="" mask="0x00004000" name="CNEN1B" />
            <bitfield caption="" mask="0x00008000" name="CNEN1B" />
         </register>
